openFoamRepoDev/tutorials/incompressible/pimpleFoam/laminar/contaminatedDroplet2D/system/faSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             Euler;
}

gradSchemes
{
    default             leastSquares;
}

divSchemes
{
    default             none;
    div(Us)             Gauss linear;
    div(phis,Cs)        Gauss upwind;
}

laplacianSchemes
{
    default             none;
    laplacian(diffusion,Cs)    Gauss linear corrected;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             corrected;
}


// ************************************************************************* //
